package com.YFFramework.game.core.module.rank.data
{
	/**
	 * 存储其他玩家信息的Vo
	 * @version 1.0.0
	 * creation time：2013-6-24 下午3:06:11
	 * 
	 */
	public class OtherHeroDyVo
	{
		//======================================================================
		//       public property
		//======================================================================
		
		//======================================================================
		//       private property
		//======================================================================
		/** 角色ID
		 */		
		public var playerId:int;
		/** 战斗力
		 */		
		public var power:int;
		/** 性别
		 */		
		public var sex:int;
		/** 名称
		 */		
		public var name:String;
		/** 经验值
		 */		
//		public var exp:int;
		/** 职业
		 */		
		public var career:int;
		/** 等级
		 */		
		public var level:int;
		/** 公会
		 */		
		public var guildName:String;
		/** 活力
		 */		
//		public var energy:int;
		/** pk值
		 */		
//		public var pk_value:int;
		/** 阅历
		 */		
//		public var see_value:int;
		/** 潜力
		 */		
//		public var potential:int;
		/** 荣誉值 */		
//		public var honor:int;
		/** 称号id */		
		public var title_id:int;
		/** 穿戴装备信息数组
		 */		
		public var equips:Array;
		/** 属性数组
		 */		
//		public var attrs:Array;
		//======================================================================
		//        constructor
		//======================================================================
		
		public function OtherHeroDyVo()
		{
		}
		
		//======================================================================
		//        public function
		//======================================================================
		
		//======================================================================
		//        private function
		//======================================================================
		
		//======================================================================
		//        event handler
		//======================================================================
		
		//======================================================================
		//        getter&setter
		//======================================================================
		
		
	}
} 