package com.YFFramework.game.core.module.rank.data
{
	/**
	 * @version 1.0.0
	 * creation time：2013-6-18 下午3:27:01
	 * 
	 */
	public class RankDyVo
	{
		//======================================================================
		//       public property
		//======================================================================
		/** 排行榜的静态分类id */	
		public var rankConfigType:int;
		/** 排名 */		
		public var rankOrder:int;
		/** 玩家名字(其他玩家) */		
		public var playerName:String;
		/** 用于排行的数值(战斗力或银锭、等级什么的) */
		public var rankValue:int;
		/** 其他玩家的id，用于查询 */		
		public var characterId:int=0;
		/** 宠物动态ID(用于确定某宠物) */		
		public var petId:int=0;
		/** 宠物静态id，来找到宠物名称 */		
		public var petConfigId:int=0;
		/** 玩家等级 */		
		public var level:int=0;
		/** 宠物等级 */		
		public var petLevel:int=0;
		/**职业id */		
		public var playerCareer:int=0;
		/** 公会名称 */		
		public var guildName:String='';
		/** vip等级 */
		public var vipLevel:int=0;
		/** 1.如果是年费才会发，2.值为2才是年费 */
		public var vipType:int=0;
		/** 称号id */
		public var titleId:int=0;
		//======================================================================
		//       private property
		//======================================================================
		
		//======================================================================
		//        constructor
		//======================================================================
		
		public function RankDyVo()
		{
		}
		
		//======================================================================
		//        public function
		//======================================================================
		
		//======================================================================
		//        private function
		//======================================================================
		
		//======================================================================
		//        event handler
		//======================================================================
		
		//======================================================================
		//        getter&setter
		//======================================================================
		
		
	}
} 