package com.YFFramework.game.core.module.notMetion.data
{
	/**
	 * 存储所有有"本次不再提示"模块的变量的地方
	 * @author jina;
	 * @version 1.0.0
	 * creation time：2013-11-5 下午2:38:16
	 */
	public class NotMetionDataManager
	{
		//======================================================================
		//       public property
		//======================================================================
		
		//======================================================================
		//       private property
		//======================================================================
		/** 背包开启格子;true->这个提示面板要打开 */		
		public static var bagOpenGrid:Boolean=true;
		/** 仓库开启格子;true->这个提示面板要打开 */	
		public static var storeOpenGrid:Boolean=true;
		/** 黑市商店刷新;true->这个提示面板要打开 */
		public static var blackShopRefresh:Boolean=true;
		/** 宠物技能学习;true->这个提示面板要打开 */
		public static var petLearnSkill:Boolean=true;
		//======================================================================
		//        constructor
		//======================================================================
		
		public function NotMetionDataManager()
		{
		}
		
		//======================================================================
		//        public function
		//======================================================================
		
		//======================================================================
		//        private function
		//======================================================================
		
		//======================================================================
		//        event handler
		//======================================================================
		
		//======================================================================
		//        getter&setter
		//======================================================================
		
		
	}
} 